tutorialsDyM/2DBulldozer_partial/Case1D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            (overset fvMotionSolvers);

application     overSedDymFoam_rbgh;

startFrom       latestTime;

startTime       0.38;

stopAt          endTime;

endTime         100.;

deltaT          0.0000025;

//writeControl    timeStep;
//writeInterval   10;

writeControl    adjustable;
writeInterval   100;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.01;
maxAlphaCo           0.01;
maxDeltaT       1e-3;

// ************************************************************************* //
